)ATTR DEFAULT(@$_)
   @   TYPE(TEXT)  INTENS(HIGH) SKIP(ON)
   $   TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(GREEN)
   _   TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
)BODY EXPAND(\\)
@Tutorial$-\-\-(@RUNC - Edit Macro$)-\-\-@Tutorial
@Command ===>_ZCMD
$
$Advanced Examples:
$
$    Using ISPF Services
$
@    ispexec libdef ispplib dataset id('&&rdsn')
@    select pgm(isplls) parm(ispplib)
@    ispexec libdef ispplib
@    edit dataset(runc.cmds) macro(runc) parm(-a)
$
$    Using TSO Services
$
@    altlib activate application(exec) dataset('&&rdsn')
@    %testcmd
@    altlib deactivate application(exec)
$
$    Using OMVS Services
$
@    omvs cd /etc;ls -laR
$
$ \ \ (press@ENTER$to continue) \ \
)PROC
  &ZUP    = #RUNC8
  &ZCONT  = #RUNC
)END
