)ATTR
 @ TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
 | TYPE(OUTPUT) INTENS(HIGH) COLOR(PINK)   CAPS(OFF)
 ê TYPE(OUTPUT) INTENS(HIGH) COLOR(RED)    CAPS(OFF)
 + TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
 ! TYPE(OUTPUT) INTENS(LOW)  COLOR(GREEN)  CAPS(OFF)
 % TYPE(TEXT)   INTENS(HIGH) COLOR(WHITE)
 ~ TYPE(TEXT)   INTENS(HIGH) COLOR(TURQ)
)BODY expand(³³) lmsg(ldsilmsg)
%-³-³- ~LISTDSI: List Dataset Information% -³-³-
%Command ===>_ZCMD                                          ~SYS variables?_LDV~
+                                                           ~DirectoryInfo?_DYN~
~DSNAME  ===>_LDSIDSN                                       ~
~VOLUME  ===>_VOLUME+
+SYSDSNAME:@LDSIQDSN
+           SYSVOLUME:@ldsivol                         +SYSCREATE:@ldsicdte
+             SYSUNIT:@ldsiunit                       +SYSREFDATE:@ldsildte
+            SYSDSORG:@ldsidorg                        +SYSEXDATE:@ldsixdte
+            SYSRECFM:@ldsircfm                      +SYSPASSWORD:@ldsipswd
+            SYSLRECL:@ldsilrcl                         +SYSRACFA:@ldsiracf
+          SYSBLKSIZE:@ldsibsiz                       +SYSUPDATED:@ldsichng
+           SYSKEYLEN:@ldsikeyl                       +SYSTRKSCYL:@ldsitpcv
+            SYSUNITS:@ldsistyp                       +SYSBLKSTRK:@ldsibptv
+            SYSALLOC:@ldsialoc                       !LDSIVDI1   @ldsiadirêZ
+             SYSUSED:@ldsiused                       !LDSIVDI2   @ldsiudirêZ
+          SYSPRIMARY:@ldsiprim                       !LDSIVDI3   @ldsimemsêZ
+          SYSSECONDS:@ldsisdry                     +LASTCC or RC:@ldsirc
+          SYSEXTENTS:@ldsiexts                        +SYSREASON:@ldsireas
|ldsiem0                                          +êLDSIXDER
êldsilmsg
@ldsiem1
@ldsiem2
                          +Press%END+to Exit LISTDSI+
)INIT
 .HELP = $LISTDSI
 &DYN = TRANS(&NODIR NODIR,NO ' ',YES *,NO)
 &LDV = TRANS(&LDV     YES,YES        *,NO)

 IF (&LDSILOCK  = LOCK)  .CURSOR = ZCMD  .ATTR(LDSIDSN) = 'TYPE(OUTPUT)'
 IF (&LDSILOCK NE LOCK)  .CURSOR = LDSIDSN

 IF (&LDSIVDIR = &Z)        &LDSIDIRZ = NOSHOW
 IF (&LDSIVDIR = DIRECTORY) &LDSIDIRZ =   SHOW
 IF (&LDSIDORG NE PO,POU)   &LDSIDIRZ = NOSHOW
 IF (&LDSIDORG = &Z)
   IF (&LDSIDSN = &Z)       &LDSIDIRZ = SHOW

 IF (&LDSIDIRZ = NOSHOW,&Z)
   &LDSIVDI1 = &Z
   &LDSIVDI2 = &Z
   &LDSIVDI3 = &Z

 IF (&LDSIDIRZ = SHOW)
   &LDSIVDI1 = 'SYSADIRBLK:              '
   &LDSIVDI2 = 'SYSUDIRBLK:         '
   &LDSIVDI3 = 'SYSMEMBERS:       '

 IF (&LDSIFDSN  = &Z)     &LDSIQDSN = &Z
 IF (&LDSIFDSN NE &Z)     &LDSIQDSN = &LDSIFDSN   /* '''&LDSIFDSN''' */
 IF (&LDSISTAT  = OK)     &LDSIEM0  = &Z
 IF (&LDSISTAT NE OK)     &LDSIEM0  = '&LDSISTAT'

 &SHORT = &Z   &LONG = &Z

 IF (&LDSIRC =  4)
   &LONG = 'Some dsn info is NOT avail. +
            LISTDSI info (other that directory info) is valid.'
   .MSG = SYS010

 IF (&LDSIRC = 16)
   &LONG = 'SEVERE Error occured. +
            NONE of displayed LISTDSI data can be considered valid.'
   .MSG = SYS010

 .ZVARS = '(LDSIXD1,LDSIXD2,LDSIXD3)'

 &LDSIXD1 = &Z   &LDSIXD2 = &Z  &LDSIXD3 = &Z  &LDSIXDER = &Z

 IF (&LDSIDORG = PO,POU)
   IF (&LDSIADIR = 0)
     &LDSIXD1 = '*'  &LDSIXD2 = '*'  &LDSIXD3 = '*'
     &LDSIXDER = '* Directory is unavailable.'

)PROC

 VER (&LDSIDSN,NB,DSNAME)

 &LDV = TRANS(TRUNC(&LDV,1) Y,YES N,NO *,*)
 VER (&LDV,LIST,YES,NO)
 IF (&LDV = YES)    &PANEL = DDINFO2
 IF (&LDV = NO,&Z)  &PANEL = DDINFO

 &DYN = TRANS(TRUNC(&DYN,1) Y,YES N,NO *,*)
 VER (&DYN,LIST,YES,NO)
 IF (&DYN = YES)    &NODIR = &Z
 IF (&DYN = NO,&Z)  &NODIR = 'NODIR'

 &VLDSISVN = &LDV      VPUT (VLDSISVN) PROFILE
)END
